user_app_api/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
  def index
        @users = User.order("created_at DESC")

INSERT INTO "users" ("name", "email", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "bảo"], ["email", "abc@gmail"], ["phone", 123], ["address", "12 trrr"], ["created_at", "2020-02-05 17:51:12.450999"], ["updated_at", "2020-02-05 17:51:12.450999"]]
---
def create
    @user =User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "phone" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "bảo"], ["email", "abc@gmail"], ["phone", 123], ["address", "12 trrr"], ["updated_at", "2020-02-06 04:26:46.629295"], ["id", 4]]
---
def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)